<template>
  <div class="hello">
    <!-- Показываем заголовок приветствия, но не получаем его из родительского
     компонента, на самом деле выводится значение по умолчанию -->
    <h1>{{ msg }}</h1>
  </div>
</template>

<script>
export default {
  name: 'Hello',
  props: {
    /* В получаемых данных можно указать их тип, иначе будет сообщение
    об ошибке и можно установить значение по умолчанию */
    msg: {
      type: String,
      default: 'Приложение на Vue.js',
    },
  },
};
</script>
