/* eslint-disable import/prefer-default-export */
// Создаем объект store, он является централизованным хранилищем данных
export const store = {
  stories: [
    {
      plot: 'Если президенты не могут делать этого со своими женами, они делают это со своими странами.',
      writer: 'Иосиф Бродский',
      upvotes: 28,
      voted: false,
      id: 1,
    },
    {
      plot: 'Вы говорите - время идет. Безумцы - это вы проходите.',
      writer: 'Талмуд',
      upvotes: 8,
      voted: false,
      id: 2,
    },
    {
      plot: 'Большинство людей упускают появившуюся возможность, потому что она бывает одета в комбинезон и с виду напоминает работу.',
      writer: 'Томас Эдисон',
      upvotes: 52,
      voted: false,
      id: 3,
    },
    {
      plot: 'Так просто быть добрым - нужно только представить себя на месте другого человека прежде, чем начать его судить',
      writer: 'Марлен Дитрих',
      upvotes: 74,
      voted: false,
      id: 4,
    },
    {
      plot: 'Когда одна дверь счастья закрывается, открывается другая; но мы часто не замечаем ее, уставившись взглядом в закрытую дверь.',
      writer: 'Хелен Келлер',
      upvotes: 28,
      voted: false,
      id: 5,
    },
    {
      plot: 'Счастье - это хорошее здоровье и плохая память.',
      writer: 'Ингрид Бергман',
      upvotes: 57,
      voted: false,
      id: 6,
    },
    {
      plot: 'Нет большего вреда для державы, чем принимать хитрость за мудрость.',
      writer: 'Бэкон, Фрэнсис',
      upvotes: 23,
      voted: false,
      id: 7,
    },
    {
      plot: 'Умный человек счастлив, лишь когда удостаивается собственной похвалы, дурак же довольствуется аплодисментами окружающих.',
      writer: 'Джозеф Аддисон',
      upvotes: 33,
      voted: false,
      id: 8,
    },
    {
      plot: 'Можно дурачить часть народа все время, можно дурачить весь народ некоторое время, но нельзя дурачить все время весь народ.',
      writer: 'Авраам Линкольн',
      upvotes: 52,
      voted: false,
      id: 9,
    },
    {
      plot: 'Законодательным путем нельзя привести людей к добродетели - и это уже хорошо.',
      writer: 'Уайльд, Оскар',
      upvotes: 64,
      voted: false,
      id: 10,
    },
  ],
};
